WebServices/src/br/com/fiap/xml/deleteContact_Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.fiap.com.br/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:deleteContact>
         <arg0>
            <!--Optional:-->
            <cidade>?</cidade>
            <!--Optional:-->
            <email>fspo@email.com</email>
            <!--Optional:-->
            <endereco>?</endereco>
            <!--Optional:-->
            <estado>?</estado>
            <!--Optional:-->
            <nome>?</nome>
            <!--Optional:-->
            <pais>?</pais>
            <!--Optional:-->
            <telefone>?</telefone>
         </arg0>
      </web:deleteContact>
   </soapenv:Body>
</soapenv:Envelope>